def main():
    name = input()
    price = int(input())
    weight = int(input())
    payed = int(input())
"""
================Чек================
Товар:                      черешня
Цена:                 3кг * 2руб/кг
Итого:                         6руб
Внесено:                      10руб
Сдача:                         4руб
===================================
"""
    print(f"""================Чек================
Товар:{name:>29}
Цена:{f"{weight}кг * {price}руб/кг":>30}
Итого:                         6руб
Внесено:                      10руб
Сдача:                         4руб
===================================
""")


if __name__ == '__main__':
    main()
